In [8]:
import os
import json
import psycopg2
from psycopg2.extras import DictCursor

In [9]:
POSTGRESQL_HOST = '10.129.0.25'

In [10]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in /opt/conda/lib/python3.10/site-packages (0.5.0)
Requirement already satisfied: sqlalchemy>=2.0 in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (2.0.7)
Requirement already satisfied: ipython in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (8.11.0)
Requirement already satisfied: prettytable in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (3.7.0)
Requirement already satisfied: sqlparse in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: six in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in /opt/conda/lib/python3.10/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: greenlet!=0.4.17 in /opt/conda/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.2)
Requirement already satisfied: typing-extensions>=4.2.0 in /opt/conda/lib/python3.10/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.5.0)
Requirement already satisfied: prompt-toolkit!=3.0.37,<3.1.0,>=3.0.30 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (3.0.38)
Requirement already satisfied: matplotlib-inline in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: pickleshare in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: pexpect>4.3 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (4.8.0)
Requirement already satisfied: traitlets>=5 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (5.9.0)
Requirement already satisfied: jedi>=0.16 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.18.2)
Requirement already satisfied: decorator in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: backcall in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: stack-data in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (0.6.2)
Requirement already satisfied: pygments>=2.4.0 in /opt/conda/lib/python3.10/site-packages (from ipython->ipython-sql) (2.14.0)
Requirement already satisfied: wcwidth in /opt/conda/lib/python3.10/site-packages (from prettytable->ipython-sql) (0.2.6)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in /opt/conda/lib/python3.10/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /opt/conda/lib/python3.10/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: pure-eval in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Requirement already satisfied: executing>=1.2.0 in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (1.2.0)
Requirement already satisfied: asttokens>=2.1.0 in /opt/conda/lib/python3.10/site-packages (from stack-data->ipython->ipython-sql) (2.2.1)

In [11]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [12]:
CONNECT_DATA = 'postgresql://{}:{}@{}/{}'.format(
    os.environ['POSTGRESQL_USER'],
    os.environ['POSTGRESQL_PASSWORD'],
    POSTGRESQL_HOST,
    'demo'
)

In [ ]:
# original qauery

In [13]:
%%sql $CONNECT_DATA
SELECT departure_airport, arrival_airport
FROM Flights
JOIN Ticket_flights USING (flight_id)
JOIN Tickets USING (ticket_no)
WHERE passenger_name = 'ELLA DMITRIEVA'

7 rows affected.

[('DME', 'UUS'),
 ('DME', 'HMA'),
 ('HMA', 'DME'),
 ('SVO', 'SVX'),
 ('SVX', 'SVO'),
 ('SVX', 'MQF'),
 ('MQF', 'SVX')]

In [ ]:
# updated qauery

In [14]:
%%sql $CONNECT_DATA
SELECT 
    dep.city AS departure_city, 
    arr.city AS arrival_city
FROM 
    Flights f
JOIN 
    Ticket_flights tf ON f.flight_id = tf.flight_id
JOIN 
    Tickets t ON tf.ticket_no = t.ticket_no
JOIN 
    Airports dep ON f.departure_airport = dep.airport_code
JOIN 
    Airports arr ON f.arrival_airport = arr.airport_code
WHERE 
    t.passenger_name = 'ELLA DMITRIEVA'

7 rows affected.

[('Moscow', 'Yekaterinburg'),
 ('Yekaterinburg', 'Moscow'),
 ('Yekaterinburg', 'Magnetiogorsk'),
 ('Magnetiogorsk', 'Yekaterinburg'),
 ('Moscow', 'Yuzhno-Sakhalinsk'),
 ('Moscow', 'Khanty-Mansiysk'),
 ('Khanty-Mansiysk', 'Moscow')]

In [ ]:
# Task 1

In [28]:
%%sql $CONNECT_DATA
SELECT 
    t.passenger_name AS passenger,
    f.departure_airport,
    f.arrival_airport
FROM 
    tickets t
JOIN 
    ticket_flights tf ON t.ticket_no = tf.ticket_no
JOIN 
    flights f ON tf.flight_id = f.flight_id
WHERE 
    t.ticket_no = '0005432312164';

4 rows affected.

[('ALEKSEY GERASIMOV', 'DME', 'EGO'),
 ('ALEKSEY GERASIMOV', 'AAQ', 'EGO'),
 ('ALEKSEY GERASIMOV', 'EGO', 'DME'),
 ('ALEKSEY GERASIMOV', 'EGO', 'AAQ')]

In [34]:
%%sql $CONNECT_DATA
SELECT 
    t.passenger_name AS passenger, 
    'N/A' AS departure_airport, 
    f.arrival_airport
FROM 
    tickets t
JOIN 
    ticket_flights tf ON t.ticket_no = tf.ticket_no
JOIN 
    flights f ON tf.flight_id = f.flight_id
WHERE 
    t.ticket_no = '0005432312164';

4 rows affected.

[('ALEKSEY GERASIMOV', 'N/A', 'EGO'),
 ('ALEKSEY GERASIMOV', 'N/A', 'EGO'),
 ('ALEKSEY GERASIMOV', 'N/A', 'DME'),
 ('ALEKSEY GERASIMOV', 'N/A', 'AAQ')]

In [37]:
%%sql $CONNECT_DATA
SELECT 
    t.passenger_name, 
    f.departure_airport AS departure_airport,  
    f.arrival_airport AS arrival_airport        
FROM 
    tickets t
JOIN 
    ticket_flights tf ON t.ticket_no = tf.ticket_no
JOIN 
    flights f ON tf.flight_id = f.flight_id     
WHERE 
    t.ticket_no = '0005432312164';

4 rows affected.

[('ALEKSEY GERASIMOV', 'DME', 'EGO'),
 ('ALEKSEY GERASIMOV', 'AAQ', 'EGO'),
 ('ALEKSEY GERASIMOV', 'EGO', 'DME'),
 ('ALEKSEY GERASIMOV', 'EGO', 'AAQ')]

In [56]:
%%sql $CONNECT_DATA
SELECT * FROM aircrafts 
ORDER BY range;

9 rows affected.

[('CN1', 'Cessna 208 Caravan', 1200),
 ('CR2', 'Bombardier CRJ-200', 2700),
 ('SU9', 'Sukhoi Superjet-100', 3000),
 ('733', 'Boeing 737-300', 4200),
 ('321', 'Airbus A321-200', 5600),
 ('320', 'Airbus A320-200', 5700),
 ('319', 'Airbus A319-100', 6700),
 ('763', 'Boeing 767-300', 7900),
 ('773', 'Boeing 777-300', 11100)]